tutorials/Aerostructural/runFluid/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 274.0;

boundaryField
{
    bladeps
    {
        type            zeroGradient;
    }
    bladess
    {
        type            zeroGradient;
    }
    bladefillet
    {
        type            zeroGradient;
    }
    hub
    {
        type            zeroGradient;
    }
    shroud
    {
        type            zeroGradient;
    }
    per1
    {
        type            cyclic;
    }
    per2
    {
        type            cyclic;
    }
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
        type            zeroGradient;

    }
}


// ************************************************************************* //
